results/MariaDB/KabyLake/events/dyni-select_random_ranges.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            31390
        write:                           0
        other:                           0
        total:                           31390
    transactions:                        31390  (523.14 per sec.)
    queries:                             31390  (523.14 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0014s
    total number of events:              31390

Latency (ms):
         min:                                  0.43
         avg:                                  1.91
         max:                                  3.24
         95th percentile:                      2.43
         sum:                              59970.06

Threads fairness:
    events (avg/stddev):           31390.0000/0.00
    execution time (avg/stddev):   59.9701/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            950015
        write:                           0
        other:                           0
        total:                           950015
    transactions:                        950015 (15833.21 per sec.)
    queries:                             950015 (15833.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0002s
    total number of events:              950015

Latency (ms):
         min:                                  0.05
         avg:                                  0.13
         max:                                  2.91
         95th percentile:                      0.07
         sum:                             119496.15

Threads fairness:
    events (avg/stddev):           475007.5000/443132.50
    execution time (avg/stddev):   59.7481/0.23

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2216331
        write:                           0
        other:                           0
        total:                           2216331
    transactions:                        2216331 (36937.61 per sec.)
    queries:                             2216331 (36937.61 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0009s
    total number of events:              2216331

Latency (ms):
         min:                                  0.06
         avg:                                  0.11
         max:                                  4.57
         95th percentile:                      0.10
         sum:                             238676.37

Threads fairness:
    events (avg/stddev):           554082.7500/302023.10
    execution time (avg/stddev):   59.6691/0.18

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3009186
        write:                           0
        other:                           0
        total:                           3009186
    transactions:                        3009186 (50151.47 per sec.)
    queries:                             3009186 (50151.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0008s
    total number of events:              3009186

Latency (ms):
         min:                                  0.07
         avg:                                  0.16
         max:                                  9.34
         95th percentile:                      0.18
         sum:                             477678.62

Threads fairness:
    events (avg/stddev):           376148.2500/135591.73
    execution time (avg/stddev):   59.7098/0.10

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3144173
        write:                           0
        other:                           0
        total:                           3144173
    transactions:                        3144173 (52399.52 per sec.)
    queries:                             3144173 (52399.52 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0027s
    total number of events:              3144173

Latency (ms):
         min:                                  0.07
         avg:                                  0.30
         max:                                302.46
         95th percentile:                      0.41
         sum:                             957579.18

Threads fairness:
    events (avg/stddev):           196510.8125/48960.47
    execution time (avg/stddev):   59.8487/0.04

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3852137
        write:                           0
        other:                           0
        total:                           3852137
    transactions:                        3852137 (64198.26 per sec.)
    queries:                             3852137 (64198.26 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0027s
    total number of events:              3852137

Latency (ms):
         min:                                  0.08
         avg:                                  0.50
         max:                               2366.78
         95th percentile:                      0.52
         sum:                            1916925.38

Threads fairness:
    events (avg/stddev):           120379.2812/21312.27
    execution time (avg/stddev):   59.9039/0.02

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3725954
        write:                           0
        other:                           0
        total:                           3725954
    transactions:                        3725954 (62094.09 per sec.)
    queries:                             3725954 (62094.09 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0038s
    total number of events:              3725954

Latency (ms):
         min:                                  0.09
         avg:                                  1.03
         max:                                852.94
         95th percentile:                      1.14
         sum:                            3836150.07

Threads fairness:
    events (avg/stddev):           58218.0312/7114.69
    execution time (avg/stddev):   59.9398/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3496881
        write:                           0
        other:                           0
        total:                           3496881
    transactions:                        3496881 (58271.63 per sec.)
    queries:                             3496881 (58271.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0089s
    total number of events:              3496881

Latency (ms):
         min:                                  0.07
         avg:                                  2.19
         max:                               3058.95
         95th percentile:                      2.48
         sum:                            7675539.16

Threads fairness:
    events (avg/stddev):           27319.3828/2426.07
    execution time (avg/stddev):   59.9651/0.00